const regExps = {
  login: /^[a-z0-9]{2,30}$/i,
  password:
    /(?=.*[0-9])(?=.*[!@#$%^&*])(?=.*[a-z])(?=.*[A-Z])[0-9A-Za-z!@#$%^&*]{6,}/g,
  email: /^[0-9a-z\-\.]+\@[0-9a-z\-]{2,}\.[a-z]{2,}$/i,
  name: /^([А-ЯЁ]{1}[а-яё]{1,29}|[A-Z]{1}[a-z]{1,29})$/,
  chatName: /[А-ЯЁа-яё]{1,30}|[A-Za-z]{1,30}/,
  phone: /^(\+7|8)[0-9]{10}$/,

};
const errorMessages = {
  login: "Используйте цифры и/или латинские буквы",
  password: "Используйте цифры и/или латинские буквы и/или символы !@#$%^&*",
  email: "Введите email в формате 'youremail@domain.com'",
  name: "Используйте кириллические или латинские буквы",
  chatName: "Используйте кириллические или латинские буквы",
  phone: "Введите номер телефона в формате '8912345678'",
};
export { regExps, errorMessages };
